#+title: Emacs Configuration
#+author: Devin Pohl
#+STARTUP: content

**** TODO ACM

TODO:
- Auto-generated ACM citations apparently suck and get a lot of details wrong
- Therefore, we should consider using a separate source (Google Scholar, doitobibtex.org, or some generic doi API) to get these results
- ACM DL has some wack authentication anyway, so I can't script this without running basically an entire Marionette instance

There's no package for this, so I've written some elisp to add functionality to arXiv-citation. For adding the citations, all that needs done is writing a web-scraper and defining advice for =arxiv-citation-get-citation=. After that, everything magically works.

#+name: arxiv-acm-init
#+begin_src elisp :tangle no :eval never
(defun shizcow-init/arxiv-acm-init ()
  (require 'request)
  (require 'arxiv-citation)

  (defun doi-from-acm (url)
    ;; Individual articles are always(?) in the form of:
    ;; https://dl.acm.org/doi/<DOI>
    (when (string-match "^https:\\/\\/dl\\.acm\\.org\\/doi\\/.*$" url) (substring url (length "https://dl.acm.org/doi/")))
    )

  (defun arxiv-citation-get-acm-citation (url)
    "Obtain an ACM citation from URL."
    ;; ACM has a helpful endpoint for getting a citation:
    ;; URL: https://dl.acm.org/action/exportCiteProcCitation
    ;; Method: POST
    ;; Data: {"dois": <DOI-from-URL>, "targetFile": "custom-bibtex", "format": "bibtex"}

    ;; ACM has a mangled JS function at https://dl.acm.org/templates/jsp/_ux3/_acm/citeproc.min.js
    ;; This is complete but also WAY bigger. What's here is a fraction of the total.

    (let* ((doi (doi-from-acm url))
	   (response
	    (request-response-data
	     (request "https://dl.acm.org/action/exportCiteProcCitation"
	       :type "POST"
	       :data (list (cons "dois" doi) (cons "targetFile" "custom-bibtex") (cons "format" "bibtex"))
	       :headers '(("Cookie" . "JSESSIONID=71008ff3-1c1c-4405-85bd-5aa7c4600bff; MAID=d4f4CHOi0fN8Wj9W4iuaOA==; MACHINE_LAST_SEEN=2023-09-08T10%3A20%3A45.712-07%3A00; I2KBRCK=1; __cf_bm=CXqq08xpNGRSOP2CyUx8y5AIVpJ_A0B8UJpXlbjTPbM-1694193645-0-AbKB843AjWYG5xO5Pt45A+VSm8ybbY9HIc/i2cD3LxZZghtTY06fEoz2j7kKs8YS5e5xj2VNyPIKrDcINMLplcw=;CookieConsent={stamp:%27h7l3zW7WEN8XlLkuot6Kpzys4fiowuzZ3U7cFza+GqVXxrHIpEdHew==%27%2Cnecessary:true%2Cpreferences:false%2Cstatistics:false%2Cmarketing:false%2Cmethod:%27explicit%27%2Cver:1%2Cutc:1694193682994%2Cregion:%27us%27}")
			  ("User-Agent" . "Mozilla/5.0 (X11; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/117.0")
			  ("Accept" . "*/*")
			  ("Accept-Language" . "en-US,en;q=0.5")
			  ("Accept-Encoding" . "gzip, deflate, br"))
	       :sync t
	       :parser 'json-read
	       :error
	       (cl-function (lambda (&rest args &key response &allow-other-keys)
			      (user-error "Got error %S from %S" (request-response-error-thrown response) (request-response-url response))
			      ))
	       )))
	   (data (cdr (car (aref (alist-get 'items response) 0) )))
	   (authors_ (mapconcat (lambda (pair) (concat (alist-get 'family pair) ", " (alist-get 'given pair)))
				(cdr (cl-find-if (lambda (x) (string-equal (car x) "author")) data))
				" and "))
	   (year (aref (aref (alist-get 'date-parts (cdr (cl-find-if (lambda (x) (string-equal (car x) "issued")) data))) 0) 0))
	   (month (aref (aref (alist-get 'date-parts (cdr (cl-find-if (lambda (x) (string-equal (car x) "issued")) data))) 0) 1))
	   (title (cdr (cl-find-if (lambda (x) (string-equal (car x) "title")) data)))
	   (DOI (cdr (cl-find-if (lambda (x) (string-equal (car x) "DOI")) data)))
	   (keyword (cdr (cl-find-if (lambda (x) (string-equal (car x) "keyword")) data)))
	   (acm-type (cdr (cl-find-if (lambda (x) (string-equal (car x) "type")) data)))
	   (acm-key (cond
		     ((string-equal acm-type "PAPER_CONFERENCE") "inproceedings")
		     ((string-equal acm-type "ARTICLE") "article")
		     (t (user-error (concat "Unknown article type \"" acm-type "\" needed in arxiv-citation-get-acm-citation")))
		     ))
	   (abstract (cdr (cl-find-if (lambda (x) (string-equal (car x) "abstract")) data)))
	   ;; the below are all nullable
	   (isbn (cdr (cl-find-if (lambda (x) (string-equal (car x) "ISBN")) data)))
	   (issn (cdr (cl-find-if (lambda (x) (string-equal (car x) "ISSN")) data)))
	   (container-title (cdr (cl-find-if (lambda (x) (string-equal (car x) "container-title")) data)))
	   (numpages (let ((numpages (cdr (cl-find-if (lambda (x) (string-equal (car x) "numpages")) data)))
			   (number-pages (cdr (cl-find-if (lambda (x) (string-equal (car x) "number-of-pages")) data))))
		       (if numpages numpages number-pages)))
	   (page (cdr (cl-find-if (lambda (x) (string-equal (car x) "page")) data)))
	   (publisher (cdr (cl-find-if (lambda (x) (string-equal (car x) "publisher")) data)))
	   (address (cdr (cl-find-if (lambda (x) (string-equal (car x) "publisher-place")) data)))
	   (articleno (cdr (cl-find-if (lambda (x) (string-equal (car x) "collection-number")) data)))
	   (issue (cdr (cl-find-if (lambda (x) (string-equal (car x) "issue")) data)))
	   (number (cdr (cl-find-if (lambda (x) (string-equal (car x) "number")) data)))
	   (volume (cdr (cl-find-if (lambda (x) (string-equal (car x) "volume")) data)))
	   ;; for debug:
	   ;; (remaining-json (cl-remove-if (lambda (x) (cl-find-if (lambda (y) (string-equal (car x) y)) '("author" "id" "type" "accessed" "issued" "original-date" "call-number" "event-place" "DOI" "keyword" "title" "URL" "abstract" "collection-number" "container-title" "ISBN" "collection-title" "ISSN" "issue" "number" "number-of-pages" "page" "publisher" "publisher-place" "source" "volume"))) data))
	   )

      (cl-flet ((mk-citation (key)
                  (concat (concat "@" acm-key "{") (or key "") ",\n"
                          " author        = {" authors_ "},\n"
                          " year          = {" (number-to-string year) "},\n"
                          " month         = {" (number-to-string month) "},\n"
                          " title         = {" title "},\n"
                          " doi           = {" DOI "},\n"
                          " keywords      = {" keyword "},\n"
                          " abstract      = {" abstract "},\n"
                          " url           = {" url "},\n"
			  (when isbn
			    (concat " isbn          = {" isbn "},\n"))
			  (when issn
			    (concat " issn          = {" issn "},\n"))
			  (when container-title
			    (concat " booktitle     = {" container-title "},\n"))
			  (when numpages
			    (concat " numpages      = {" numpages "},\n"))
			  (when page
			    (concat " pages         = {" page "},\n"))
			  (when publisher
			    (concat " publisher     = {" publisher "},\n"))
			  (when address
			    (concat " address       = {" address "},\n"))
			  (when articleno
			    (concat " articleno     = {" articleno "},\n"))
			  (when issue
			    (concat " number        = {" issue "},\n"))
			  (when volume
			    (concat " volume        = {" volume "},\n"))
                          "}")))
	(mk-citation (with-temp-buffer
                       (insert (mk-citation nil))
                       (arxiv-citation-generate-autokey))))
      
      ))

  (advice-add 'arxiv-citation-get-citation :around
	      (lambda (origfun &rest r)
		(if (doi-from-acm (car r)) (apply 'arxiv-citation-get-acm-citation r) (apply origfun r))
		))
  )
#+end_src

An example which can also be called interactively:
#+begin_src emacs-lisp :tangle no :noweb yes
<<arxiv-acm-init>>
(shizcow-init/arxiv-acm-init)
(arxiv-citation-get-acm-citation "https://dl.acm.org/doi/10.1145/192724.192731")
#+end_src

#+RESULTS:
: 10.1145/192724.192731

**** Nature
Similar to ACM, there is no package with clean integration to gather bibtex entries from [[https://www.nature.com/srep/][the journal Nature's website]] (not necessarily Nature itself).

#+name: arxiv-nature-init
#+begin_src elisp :tangle no :eval never
(defun shizcow-init/arxiv-nature-init ()
  (require 'request)
  (require 'arxiv-citation)

  (defun doi-from-nature (url)
    ;; DOI information is NOT encoded in the URL
    ;; Performing a GET request will return a web page containing the meta tag:
    ;;   <meta name="DOI" content="<DOI>"/>
    (when (string-match "^https:\\/\\/www\\.nature\\.com\\/articles\\/.*$" url)
      ;; Do query
      (let* ((response
	      (request-response-data
	       (request url
		 :type "GET"
		 :sync t
		 ;; Parsing the actual HTML:
		 :parser (lambda () (libxml-parse-html-region (point) (point-max)))
		 ))))
	(dom-attr
	 (cl-find-if
	  (lambda (meta-node)
	    ;; Case insensitive match
	    (cl-equalp "DOI" (dom-attr meta-node 'name))
	    )
	  (dom-by-tag response 'meta))
	 'content))))

  
  (defun arxiv-citation-get-nature-citation (url)
    "Obtain a citation from an article on the journal Nature"
    ;; Nature has a helpful endpoint for getting a citation:
    ;; URL: https://citation-needed.springer.com/v2/references/<DOI>?format=refman&flavour=citation
    ;; METHOD: GET

    (let* ((doi (doi-from-nature url))
	   (api-url (concat "https://citation-needed.springer.com/v2/references/" doi))
	   (response
	    (request-response-data
	     (request api-url
	       :type "GET"
	       :data '(("format" . "refman") ("flavour" . "citation"))
	       :sync t
	       :parser 'buffer-string
	       )))
	   (cite-keys
	    ;; The response is in the format:
	    ;; <KEY>   - <VAL>
	    ;; Where each line has one entry and there can be duplicate entries
	    ;; A list of key meanings:
	    ;; TY: Type; "JOUR" for journal
	    ;; AU: Author; Possibly duplicates
	    ;; PY: Print Year
	    ;; DA: Date in YY/MM/DD format
	    ;; TI: Title
	    ;; JO: Journal name
	    ;; SP: Article number
	    ;; VL: Volums
	    ;; IS: Issue
	    ;; AB: Abstract
	    ;; SN: ISSN
	    ;; UR: URL
	    ;; DO: DOI
	    ;; ID: Bibtex citation ID -- discarded due to over-simplification
	    ;; Parse the response into tuples for later consumption
	    (remq nil 
		  (mapcar
		   (lambda (response-line)
		     ;; Split on the (first) '-' character
		     (let ((dash-location
			    (cl-position ?- response-line :test 'char-equal)))
		       (when dash-location
			 (list
			  (string-trim (substring response-line 0 dash-location))
			  (string-trim (substring response-line (+ 1 dash-location)))))))
		   (split-string response "\n"))))
	   (authors_ (mapconcat (lambda (tuple) (nth 1 tuple))
				(cl-remove-if-not (lambda (tuple) (string-equal "AU" (car tuple))) cite-keys)
				" and "))
	   (YMD-string (nth 1 (cl-find-if (lambda (tuple) (string-equal "DA" (car tuple))) cite-keys)))
	   (year  (progn
		    (string-match "\\([0-9][0-9][0-9][0-9]\\)/\\([0-9][0-9]\\)/\\([0-9][0-9]\\)" YMD-string)
		    (match-string 1 YMD-string)
		    ))
	   (month (match-string 2 YMD-string))
	   (day   (match-string 2 YMD-string))
	   (title (nth 1 (cl-find-if (lambda (tuple) (string-equal "TI" (car tuple))) cite-keys)))
	   (DOI (nth 1 (cl-find-if (lambda (tuple) (string-equal "DO" (car tuple))) cite-keys)))
	   (nature-type (nth 1 (cl-find-if (lambda (tuple) (string-equal "TY" (car tuple))) cite-keys)))
	   (nature-key (cond
			((string-equal nature-type "JOUR") "article")
			(t (user-error (concat "Unknown article type \"" nature-type "\" needed in arxiv-citation-get-nature-citation")))
			))
	   (abstract (nth 1 (cl-find-if (lambda (tuple) (string-equal "AB" (car tuple))) cite-keys)))
	   (cite-url (nth 1 (cl-find-if (lambda (tuple) (string-equal "UR" (car tuple))) cite-keys)))
	   (cite-doi (nth 1 (cl-find-if (lambda (tuple) (string-equal "DO" (car tuple))) cite-keys)))
	   ;; The below are all nullable
	   (issn (nth 1 (cl-find-if (lambda (tuple) (string-equal "SN" (car tuple))) cite-keys)))
	   (container-title (nth 1 (cl-find-if (lambda (tuple) (string-equal "JO" (car tuple))) cite-keys)))
	   (number (nth 1 (cl-find-if (lambda (tuple) (string-equal "SP" (car tuple))) cite-keys)))
	   (volume (nth 1 (cl-find-if (lambda (tuple) (string-equal "VL" (car tuple))) cite-keys))))
      (cl-flet ((mk-citation (key)
                  (concat (concat "@" nature-key "{") (or key "") ",\n"
                          " author        = {" authors_ "},\n"
                          " year          = {" year "},\n"
                          " month         = {" month "},\n"
                          " day           = {" day "},\n"
                          " title         = {" title "},\n"
                          " doi           = {" cite-doi "},\n"
                          " abstract      = {" abstract "},\n"
                          " url           = {" cite-url "},\n"
			  (when issn
			    (concat " issn          = {" issn "},\n"))
			  (when container-title
			    (concat " journal       = {" container-title "},\n"))
			  (when number
			    (concat " number        = {" number "},\n"))
			  (when volume
			    (concat " volume        = {" volume "},\n"))
                          "}")))
	(mk-citation (with-temp-buffer
                       (insert (mk-citation nil))
                       (arxiv-citation-generate-autokey))))
      ))

  (advice-add 'arxiv-citation-get-citation :around
	      (lambda (origfun &rest r)
		(if (doi-from-nature (car r)) (apply 'arxiv-citation-get-nature-citation r) (apply origfun r))
		))
  )
#+end_src

#+begin_src elisp :noweb yes :tangle no
<<arxiv-nature-init>>
(shizcow-init/arxiv-nature-init)
(arxiv-citation-get-citation "https://www.nature.com/articles/s41598-019-46595-w")
#+end_src

#+RESULTS:
#+begin_example
@article{chen19:adiab-quant-flux-param,
 author        = {Chen, Olivia and Cai, Ruizhe and Wang, Yanzhi and Ke, Fei and Yamae, Taiki and Saito, Ro and Takeuchi, Naoki and Yoshikawa, Nobuyuki},
 year          = {2019},
 month         = {07},
 day           = {07},
 title         = {Adiabatic Quantum-Flux-Parametron: Towards Building Extremely Energy-Efficient Circuits and Systems},
 doi           = {10.1038/s41598-019-46595-w},
 abstract      = {Adiabatic Quantum-Flux-Parametron (AQFP) logic is an adiabatic superconductor logic family that has been proposed as a future technology towards building extremely energy-efficient computing systems. In AQFP logic, dynamic energy dissipation can be drastically reduced due to the adiabatic switching operations using AC excitation currents, which serve as both clock signals and power supplies. As a result, AQFP could overcome the power/energy dissipation limitation in conventional superconductor logic families such as rapid-single-flux-quantum (RSFQ). Simulation and experimental results show that AQFP logic can achieve an energy-delay-product (EDP) near quantum limit using practical circuit parameters and available fabrication processes. To shed some light on the design automation and guidelines of AQFP circuits, in this paper we present an automatic synthesis framework for AQFP and perform synthesis on 18 circuits, including 11 ISCAS-85 circuit benchmarks, 6 deep-learning accelerator components, and a 32-bit RISC-V ALU, based on our developed standard cell library of AQFP technology. Synthesis results demonstrate the significant advantage of AQFP technology. We forecast 9,313×, 25,242× and 48,466× energy-per-operation advantage, compared to the synthesis results of TSMC (Taiwan Semiconductor Manufacturing Company) 12 nm fin field-effect transistor (FinFET), 28 nm and 40 nm complementary metal-oxide-semiconductor (CMOS) technology nodes, respectively.},
 url           = {https://doi.org/10.1038/s41598-019-46595-w},
 issn          = {2045-2322},
 journal       = {Scientific Reports},
 number        = {10514},
 volume        = {9},
}
#+end_example

** Sage
Sagemath is a Python-derived language which allows for high-level symbolic calculation.
=ob-sagemath= is a package that allows integration with org-mode.
When writing anything that needs latex math-mode typesetting, it is generally preferred to use sage due to (1) its automatic typesetting from a more abstract representation and (2) the ability to evaluate the input.

The following elisp sets up =ob-sagemath=:

#+begin_src elisp
(when (executable-find "sage")
  (use-package sage-shell-mode)
  (use-package ob-sagemath
    :after org
    :after sage-shell-mode
    :config
    ;; Ob-sagemath supports only evaluating with a session.
    (setq org-babel-default-header-args:sage '((:session . t)
                                               (:results . "output")))
    ;; And set up integration with ox-latex
    (add-to-list 'org-latex-listings-langs '(sage "python")) ; python-style highlighting
    (add-to-list 'org-latex-minted-langs '(sage "python")) ; python-style highlighting
    ))
#+end_src

#+RESULTS:
: t

Where an example of use is:
#+begin_src sage :tangle no
var('x,y')
f1 = x == y + 1
f2 = 2 * y == x
solve([f1, f2], x, y)
#+end_src

#+RESULTS:
: (x, y)
: [[x == 2, y == 1]]

** DOI
The following function will extract a DOI from a non-DOI address.
This is an [[https://www.crossref.org/blog/urls-and-dois-a-complicated-relationship/][impossible task]], but we can make it work for certain classes of URLs by defining specific functions that work on classes of URLs.

The important functions defined here are =shizcow/try-doi-from=, which returns a DOI from a URL, and =shizcow/add-doi-scraper= which allows for writing another specific DOI parser.

This would be called as:
#+begin_src elisp :tangle no
(shizcow/try-doi-from "https://ieeexplore.ieee.org/document/1234567")
(shizcow/try-doi-from "https://dl.acm.org/doi/10.1145/3650212.3680307")
#+end_src

#+RESULTS:
: https://doi.org/10.1145/3650212.3680307

** TODO ACM

Old stuff, need to clean out


TODO:
- Auto-generated ACM citations apparently suck and get a lot of details wrong
- Therefore, we should consider using a separate source (Google Scholar, doitobibtex.org, or some generic doi API) to get these results
- ACM DL has some wack authentication anyway, so I can't script this without running basically an entire Marionette instance

There's no package for this, so I've written some elisp to add functionality to arXiv-citation. For adding the citations, all that needs done is writing a web-scraper and defining advice for =arxiv-citation-get-citation=. After that, everything magically works.

#+name: arxiv-acm-init
#+begin_src elisp :tangle no :eval never
(defun shizcow-init/arxiv-acm-init ()
  (require 'request)
  (require 'arxiv-citation)

  (defun doi-from-acm (url)
    ;; Individual articles are always(?) in the form of:
    ;; https://dl.acm.org/doi/<DOI>
    (when (string-match "^https:\\/\\/dl\\.acm\\.org\\/doi\\/.*$" url) (substring url (length "https://dl.acm.org/doi/")))
    )

  (defun arxiv-citation-get-acm-citation (url)
    "Obtain an ACM citation from URL."
    ;; ACM has a helpful endpoint for getting a citation:
    ;; URL: https://dl.acm.org/action/exportCiteProcCitation
    ;; Method: POST
    ;; Data: {"dois": <DOI-from-URL>, "targetFile": "custom-bibtex", "format": "bibtex"}

    ;; ACM has a mangled JS function at https://dl.acm.org/templates/jsp/_ux3/_acm/citeproc.min.js
    ;; This is complete but also WAY bigger. What's here is a fraction of the total.

    (let* ((doi (doi-from-acm url))
	   (response
	    (request-response-data
	     (request "https://dl.acm.org/action/exportCiteProcCitation"
	       :type "POST"
	       :data (list (cons "dois" doi) (cons "targetFile" "custom-bibtex") (cons "format" "bibtex"))
	       :headers '(("Cookie" . "JSESSIONID=71008ff3-1c1c-4405-85bd-5aa7c4600bff; MAID=d4f4CHOi0fN8Wj9W4iuaOA==; MACHINE_LAST_SEEN=2023-09-08T10%3A20%3A45.712-07%3A00; I2KBRCK=1; __cf_bm=CXqq08xpNGRSOP2CyUx8y5AIVpJ_A0B8UJpXlbjTPbM-1694193645-0-AbKB843AjWYG5xO5Pt45A+VSm8ybbY9HIc/i2cD3LxZZghtTY06fEoz2j7kKs8YS5e5xj2VNyPIKrDcINMLplcw=;CookieConsent={stamp:%27h7l3zW7WEN8XlLkuot6Kpzys4fiowuzZ3U7cFza+GqVXxrHIpEdHew==%27%2Cnecessary:true%2Cpreferences:false%2Cstatistics:false%2Cmarketing:false%2Cmethod:%27explicit%27%2Cver:1%2Cutc:1694193682994%2Cregion:%27us%27}")
			  ("User-Agent" . "Mozilla/5.0 (X11; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/117.0")
			  ("Accept" . "*/*")
			  ("Accept-Language" . "en-US,en;q=0.5")
			  ("Accept-Encoding" . "gzip, deflate, br"))
	       :sync t
	       :parser 'json-read
	       :error
	       (cl-function (lambda (&rest args &key response &allow-other-keys)
			      (user-error "Got error %S from %S" (request-response-error-thrown response) (request-response-url response))
			      ))
	       )))
	   (data (cdr (car (aref (alist-get 'items response) 0) )))
	   (authors_ (mapconcat (lambda (pair) (concat (alist-get 'family pair) ", " (alist-get 'given pair)))
				(cdr (cl-find-if (lambda (x) (string-equal (car x) "author")) data))
				" and "))
	   (year (aref (aref (alist-get 'date-parts (cdr (cl-find-if (lambda (x) (string-equal (car x) "issued")) data))) 0) 0))
	   (month (aref (aref (alist-get 'date-parts (cdr (cl-find-if (lambda (x) (string-equal (car x) "issued")) data))) 0) 1))
	   (title (cdr (cl-find-if (lambda (x) (string-equal (car x) "title")) data)))
	   (DOI (cdr (cl-find-if (lambda (x) (string-equal (car x) "DOI")) data)))
	   (keyword (cdr (cl-find-if (lambda (x) (string-equal (car x) "keyword")) data)))
	   (acm-type (cdr (cl-find-if (lambda (x) (string-equal (car x) "type")) data)))
	   (acm-key (cond
		     ((string-equal acm-type "PAPER_CONFERENCE") "inproceedings")
		     ((string-equal acm-type "ARTICLE") "article")
		     (t (user-error (concat "Unknown article type \"" acm-type "\" needed in arxiv-citation-get-acm-citation")))
		     ))
	   (abstract (cdr (cl-find-if (lambda (x) (string-equal (car x) "abstract")) data)))
	   ;; the below are all nullable
	   (isbn (cdr (cl-find-if (lambda (x) (string-equal (car x) "ISBN")) data)))
	   (issn (cdr (cl-find-if (lambda (x) (string-equal (car x) "ISSN")) data)))
	   (container-title (cdr (cl-find-if (lambda (x) (string-equal (car x) "container-title")) data)))
	   (numpages (let ((numpages (cdr (cl-find-if (lambda (x) (string-equal (car x) "numpages")) data)))
			   (number-pages (cdr (cl-find-if (lambda (x) (string-equal (car x) "number-of-pages")) data))))
		       (if numpages numpages number-pages)))
	   (page (cdr (cl-find-if (lambda (x) (string-equal (car x) "page")) data)))
	   (publisher (cdr (cl-find-if (lambda (x) (string-equal (car x) "publisher")) data)))
	   (address (cdr (cl-find-if (lambda (x) (string-equal (car x) "publisher-place")) data)))
	   (articleno (cdr (cl-find-if (lambda (x) (string-equal (car x) "collection-number")) data)))
	   (issue (cdr (cl-find-if (lambda (x) (string-equal (car x) "issue")) data)))
	   (number (cdr (cl-find-if (lambda (x) (string-equal (car x) "number")) data)))
	   (volume (cdr (cl-find-if (lambda (x) (string-equal (car x) "volume")) data)))
	   ;; for debug:
	   ;; (remaining-json (cl-remove-if (lambda (x) (cl-find-if (lambda (y) (string-equal (car x) y)) '("author" "id" "type" "accessed" "issued" "original-date" "call-number" "event-place" "DOI" "keyword" "title" "URL" "abstract" "collection-number" "container-title" "ISBN" "collection-title" "ISSN" "issue" "number" "number-of-pages" "page" "publisher" "publisher-place" "source" "volume"))) data))
	   )

      (cl-flet ((mk-citation (key)
                  (concat (concat "@" acm-key "{") (or key "") ",\n"
                          " author        = {" authors_ "},\n"
                          " year          = {" (number-to-string year) "},\n"
                          " month         = {" (number-to-string month) "},\n"
                          " title         = {" title "},\n"
                          " doi           = {" DOI "},\n"
                          " keywords      = {" keyword "},\n"
                          " abstract      = {" abstract "},\n"
                          " url           = {" url "},\n"
			  (when isbn
			    (concat " isbn          = {" isbn "},\n"))
			  (when issn
			    (concat " issn          = {" issn "},\n"))
			  (when container-title
			    (concat " booktitle     = {" container-title "},\n"))
			  (when numpages
			    (concat " numpages      = {" numpages "},\n"))
			  (when page
			    (concat " pages         = {" page "},\n"))
			  (when publisher
			    (concat " publisher     = {" publisher "},\n"))
			  (when address
			    (concat " address       = {" address "},\n"))
			  (when articleno
			    (concat " articleno     = {" articleno "},\n"))
			  (when issue
			    (concat " number        = {" issue "},\n"))
			  (when volume
			    (concat " volume        = {" volume "},\n"))
                          "}")))
	(mk-citation (with-temp-buffer
                       (insert (mk-citation nil))
                       (arxiv-citation-generate-autokey))))
      
      ))

  (advice-add 'arxiv-citation-get-citation :around
	      (lambda (origfun &rest r)
		(if (doi-from-acm (car r)) (apply 'arxiv-citation-get-acm-citation r) (apply origfun r))
		))
  )
#+end_src

An example which can also be called interactively:
#+begin_src emacs-lisp :tangle no :noweb yes
<<arxiv-acm-init>>
(shizcow-init/arxiv-acm-init)
(arxiv-citation-get-acm-citation "https://dl.acm.org/doi/10.1145/192724.192731")
#+end_src

#+RESULTS:
: 10.1145/192724.192731

** Nature
Similar to ACM, there is no package with clean integration to gather bibtex entries from [[https://www.nature.com/srep/][the journal Nature's website]] (not necessarily Nature itself).

#+name: arxiv-nature-init
#+begin_src elisp :tangle no :eval never
(defun shizcow-init/arxiv-nature-init ()
  (require 'request)
  (require 'arxiv-citation)

  (defun doi-from-nature (url)
    ;; DOI information is NOT encoded in the URL
    ;; Performing a GET request will return a web page containing the meta tag:
    ;;   <meta name="DOI" content="<DOI>"/>
    (when (string-match "^https:\\/\\/www\\.nature\\.com\\/articles\\/.*$" url)
      ;; Do query
      (let* ((response
	      (request-response-data
	       (request url
		 :type "GET"
		 :sync t
		 ;; Parsing the actual HTML:
		 :parser (lambda () (libxml-parse-html-region (point) (point-max)))
		 ))))
	(dom-attr
	 (cl-find-if
	  (lambda (meta-node)
	    ;; Case insensitive match
	    (cl-equalp "DOI" (dom-attr meta-node 'name))
	    )
	  (dom-by-tag response 'meta))
	 'content))))

  
  (defun arxiv-citation-get-nature-citation (url)
    "Obtain a citation from an article on the journal Nature"
    ;; Nature has a helpful endpoint for getting a citation:
    ;; URL: https://citation-needed.springer.com/v2/references/<DOI>?format=refman&flavour=citation
    ;; METHOD: GET

    (let* ((doi (doi-from-nature url))
	   (api-url (concat "https://citation-needed.springer.com/v2/references/" doi))
	   (response
	    (request-response-data
	     (request api-url
	       :type "GET"
	       :data '(("format" . "refman") ("flavour" . "citation"))
	       :sync t
	       :parser 'buffer-string
	       )))
	   (cite-keys
	    ;; The response is in the format:
	    ;; <KEY>   - <VAL>
	    ;; Where each line has one entry and there can be duplicate entries
	    ;; A list of key meanings:
	    ;; TY: Type; "JOUR" for journal
	    ;; AU: Author; Possibly duplicates
	    ;; PY: Print Year
	    ;; DA: Date in YY/MM/DD format
	    ;; TI: Title
	    ;; JO: Journal name
	    ;; SP: Article number
	    ;; VL: Volums
	    ;; IS: Issue
	    ;; AB: Abstract
	    ;; SN: ISSN
	    ;; UR: URL
	    ;; DO: DOI
	    ;; ID: Bibtex citation ID -- discarded due to over-simplification
	    ;; Parse the response into tuples for later consumption
	    (remq nil 
		  (mapcar
		   (lambda (response-line)
		     ;; Split on the (first) '-' character
		     (let ((dash-location
			    (cl-position ?- response-line :test 'char-equal)))
		       (when dash-location
			 (list
			  (string-trim (substring response-line 0 dash-location))
			  (string-trim (substring response-line (+ 1 dash-location)))))))
		   (split-string response "\n"))))
	   (authors_ (mapconcat (lambda (tuple) (nth 1 tuple))
				(cl-remove-if-not (lambda (tuple) (string-equal "AU" (car tuple))) cite-keys)
				" and "))
	   (YMD-string (nth 1 (cl-find-if (lambda (tuple) (string-equal "DA" (car tuple))) cite-keys)))
	   (year  (progn
		    (string-match "\\([0-9][0-9][0-9][0-9]\\)/\\([0-9][0-9]\\)/\\([0-9][0-9]\\)" YMD-string)
		    (match-string 1 YMD-string)
		    ))
	   (month (match-string 2 YMD-string))
	   (day   (match-string 2 YMD-string))
	   (title (nth 1 (cl-find-if (lambda (tuple) (string-equal "TI" (car tuple))) cite-keys)))
	   (DOI (nth 1 (cl-find-if (lambda (tuple) (string-equal "DO" (car tuple))) cite-keys)))
	   (nature-type (nth 1 (cl-find-if (lambda (tuple) (string-equal "TY" (car tuple))) cite-keys)))
	   (nature-key (cond
			((string-equal nature-type "JOUR") "article")
			(t (user-error (concat "Unknown article type \"" nature-type "\" needed in arxiv-citation-get-nature-citation")))
			))
	   (abstract (nth 1 (cl-find-if (lambda (tuple) (string-equal "AB" (car tuple))) cite-keys)))
	   (cite-url (nth 1 (cl-find-if (lambda (tuple) (string-equal "UR" (car tuple))) cite-keys)))
	   (cite-doi (nth 1 (cl-find-if (lambda (tuple) (string-equal "DO" (car tuple))) cite-keys)))
	   ;; The below are all nullable
	   (issn (nth 1 (cl-find-if (lambda (tuple) (string-equal "SN" (car tuple))) cite-keys)))
	   (container-title (nth 1 (cl-find-if (lambda (tuple) (string-equal "JO" (car tuple))) cite-keys)))
	   (number (nth 1 (cl-find-if (lambda (tuple) (string-equal "SP" (car tuple))) cite-keys)))
	   (volume (nth 1 (cl-find-if (lambda (tuple) (string-equal "VL" (car tuple))) cite-keys))))
      (cl-flet ((mk-citation (key)
                  (concat (concat "@" nature-key "{") (or key "") ",\n"
                          " author        = {" authors_ "},\n"
                          " year          = {" year "},\n"
                          " month         = {" month "},\n"
                          " day           = {" day "},\n"
                          " title         = {" title "},\n"
                          " doi           = {" cite-doi "},\n"
                          " abstract      = {" abstract "},\n"
                          " url           = {" cite-url "},\n"
			  (when issn
			    (concat " issn          = {" issn "},\n"))
			  (when container-title
			    (concat " journal       = {" container-title "},\n"))
			  (when number
			    (concat " number        = {" number "},\n"))
			  (when volume
			    (concat " volume        = {" volume "},\n"))
                          "}")))
	(mk-citation (with-temp-buffer
                       (insert (mk-citation nil))
                       (arxiv-citation-generate-autokey))))
      ))

  (advice-add 'arxiv-citation-get-citation :around
	      (lambda (origfun &rest r)
		(if (doi-from-nature (car r)) (apply 'arxiv-citation-get-nature-citation r) (apply origfun r))
		))
  )
#+end_src

#+begin_src elisp :noweb yes :tangle no
<<arxiv-nature-init>>
(shizcow-init/arxiv-nature-init)
(arxiv-citation-get-citation "https://www.nature.com/articles/s41598-019-46595-w")
#+end_src

#+RESULTS:
#+begin_example
@article{chen19:adiab-quant-flux-param,
 author        = {Chen, Olivia and Cai, Ruizhe and Wang, Yanzhi and Ke, Fei and Yamae, Taiki and Saito, Ro and Takeuchi, Naoki and Yoshikawa, Nobuyuki},
 year          = {2019},
 month         = {07},
 day           = {07},
 title         = {Adiabatic Quantum-Flux-Parametron: Towards Building Extremely Energy-Efficient Circuits and Systems},
 doi           = {10.1038/s41598-019-46595-w},
 abstract      = {Adiabatic Quantum-Flux-Parametron (AQFP) logic is an adiabatic superconductor logic family that has been proposed as a future technology towards building extremely energy-efficient computing systems. In AQFP logic, dynamic energy dissipation can be drastically reduced due to the adiabatic switching operations using AC excitation currents, which serve as both clock signals and power supplies. As a result, AQFP could overcome the power/energy dissipation limitation in conventional superconductor logic families such as rapid-single-flux-quantum (RSFQ). Simulation and experimental results show that AQFP logic can achieve an energy-delay-product (EDP) near quantum limit using practical circuit parameters and available fabrication processes. To shed some light on the design automation and guidelines of AQFP circuits, in this paper we present an automatic synthesis framework for AQFP and perform synthesis on 18 circuits, including 11 ISCAS-85 circuit benchmarks, 6 deep-learning accelerator components, and a 32-bit RISC-V ALU, based on our developed standard cell library of AQFP technology. Synthesis results demonstrate the significant advantage of AQFP technology. We forecast 9,313×, 25,242× and 48,466× energy-per-operation advantage, compared to the synthesis results of TSMC (Taiwan Semiconductor Manufacturing Company) 12 nm fin field-effect transistor (FinFET), 28 nm and 40 nm complementary metal-oxide-semiconductor (CMOS) technology nodes, respectively.},
 url           = {https://doi.org/10.1038/s41598-019-46595-w},
 issn          = {2045-2322},
 journal       = {Scientific Reports},
 number        = {10514},
 volume        = {9},
}
#+end_example

